In [1]:
import pandas as pd
import sqlite3

conn = sqlite3.connect("./data/db.sqlite3")

In [2]:
df_users = pd.read_sql_query("SELECT * FROM Users", conn)
df_users

,id,email,username,first_name,last_name,hashed_password,is_active,role,phone_number
0,1,test@example.com,test_user,John,Doe,$2b$12$TtlCqYi5JCnR/M1w/e3X/OPjREmhJiSddOlw0.x...,1,user,1234567890

In [3]:
df_token = pd.read_sql_query("SELECT * FROM tbl_token", conn)
print(df_token.tokenVal.values[0])
df_token

eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJ0ZXN0X3VzZXIiLCJpZCI6MSwicm9sZSI6InVzZXIiLCJleHAiOjE3NDU2MzgwMDV9.oN-azKmosm3rmBZ7xYtndNfCIWtz0WC677KbK5Xv5os

,id,serviceAccount,pladaName,clientName,is_active,tokenExp,tokenVal
0,1,test_user,dummyPlada,dummyClient,1,1,eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiO...